#define _CRT_SECURE_NO_WARNINGS 1

#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>


//int main()
//{
//	//操作符(运算符)
//	//int ret = 10 / 3;
//	////备注：对于除法操作符来说，两边的操作数都是整数，执行的是整数除法
//	////如果想计算出小数，除号的两端至少有一个操作数是浮点数
//	//double ret2 =  10.0 / 3;
//	//printf("%d\n", ret);
//	//printf("%.1lf\n", ret2);
//
//
//	//int ret = 10 % 3;//取模（取余），计算的是整除之后的余数,取模操作符的两边的操作数只能是整数
//	//printf("%d\n", ret);
//
//	return 0;
//}

//2进制
//整数的2进制表示形式，其实有3种
//原码
//反码
//补码
//内存中存储的起始是：补码的二进制
//所以在参与移位的时候，移动后都是补码
//
//12 - 数值
//2进制：1100
//8进制：14
//10进制：12
//16进制：c
//
//int main()
//{
//	//按照一个数的正负，直接写出它的二进制表示形式得到的就是原码
//	//
//	//正数
//	//正数的原码、反码、补码是相同的
//	//负数的原码、反码、补码要经过计算的
//	//反码是原码的符号位不变，其他位按位取反，就是反码
//	//补码是反码+1
//	//整型占4个字节（32bit）
//	//00000000000000000000000000001010 - 原码
//	//00000000000000000000000000001010 - 反码
//	//00000000000000000000000000001010 - 补码
//	int a = 10;
//
//	//10000000000000000000000000001010 - 原码
//	//11111111111111111111111111110101 - 反码
//	//11111111111111111111111111110110 - 补码
//
//	//11111111111111111111111111110110 - 补码
//	//10000000000000000000000000001001
//	//10000000000000000000000000001010 - 原码 
//
//	int b = -10;
//
//	return 0;
//}
//

//左移操作 <<

//int main()
//{
//	int a = 10;
//	int b = a << 1;
//	//00000000000000000000000000001010 -补码
//	printf("%d\n", b);
//	printf("%d\n", a);
//
//	return 0;
//}

//int main()
//{
//	int a = -10;
//	//10000000000000000000000000001010
//	//11111111111111111111111111110101
//	//11111111111111111111111111110110 - 补码
//	//
//	int b = a << 1;
//	//
//	//11111111111111111111111111101100 - b的补码
//	//10000000000000000000000000010011
//	//10000000000000000000000000010100 - b的原码
//	//
//	printf("b=%d\n", b);//-20
//	printf("a=%d\n", a);
//
//	return 0;
//}

//
//右移操作符
//1. 算术右移(平常见到)
//2. 逻辑右移
//

//int main()
//{
//	int a = -1;
//	//10000000000000000000000000000001
//	//11111111111111111111111111111110
//	//11111111111111111111111111111111
//	//
//	int b = a >> 1;
//	printf("%d\n", b);
//	printf("%d\n", a);
//
//	return 0;
//}

//
//int main()
//{
//	int a = 10;
//	int b = a >> -2;
//	return 0;
//}
//

//
//& - 按2进制位与
//对应的二进制位有0，则为0，两个同时为1，才为1
//
//
//int main()
//{
//	int a = 3;
//	//00000000000000000000000000000011
//	int b = -5;
//	//10000000000000000000000000000101
//	//11111111111111111111111111111010
//	//11111111111111111111111111111011 -补码
//	//
//	int c = a & b;
//	//00000000000000000000000000000011
//	//11111111111111111111111111111011
//	//00000000000000000000000000000011
//	//
//	printf("%d\n", c);
//
//	return 0;
//}

//
//按2进制位或
//对应的二进制位有1则为1，两个同时为0则为0
//
//int main()
//{
//	int a = 3;
//	//00000000000000000000000000000011
//	int b = -5;
//	//10000000000000000000000000000101
//	//11111111111111111111111111111010
//	//11111111111111111111111111111011 -补码
//	//
//	int c = a | b;
//	//00000000000000000000000000000011
//	//11111111111111111111111111111011
//	//11111111111111111111111111111011
//	//
//	printf("%d\n", c);
//
//	return 0;
//}
//

//^ - 按2进制位异或
//对应的二进制位：相同为0，相异为1
//
//int main()
//{
//	int a = 3;
//	//00000000000000000000000000000011
//	int b = -5;
//	//10000000000000000000000000000101
//	//11111111111111111111111111111010
//	//11111111111111111111111111111011 -补码
//	//
//	int c = a ^ b;
//	//00000000000000000000000000000011
//	//11111111111111111111111111111011
//	//11111111111111111111111111111000
//	//11111111111111111111111111110111
//	//10000000000000000000000000001000
//	//-8
//	printf("%d\n", c);
//
//	return 0;
//}

//一道变态的面试题：
//不能创建临时变量（第三个变量），实现两个整数的交换

//int main()
//{
//	int a = 3;
//	int b = 5;
//
//	int tmp = 0;//临时变量
//	printf("%d %d\n", a, b);
//	tmp = a;
//	a = b;
//	b = tmp;
//	printf("%d %d\n", a, b);
//
//	return 0;
//}
//
//int main()
//{
//	int a = 3;
//	int b = 5;
//
//	printf("%d %d\n", a, b);
//	a = a + b;
//	b = a - b;
//	a = a - b;
//	printf("%d %d\n", a, b);
//
//	return 0;
//}

//int main()
//{
//	int a = 3;
//	int b = 5;
//
//	printf("%d %d\n", a, b);
//	a = a ^ b;
//	b = a ^ b;
//	a = a ^ b;
//	printf("%d %d\n", a, b);
//
//	return 0;
//}
//


//int main()
//{
//	int a = 0;
//	int b = 0;
//	int c = 0, d = 0;
//	printf("%d\n", c);
//	return 0;
//}

//int main()
//{
//	int a = 10;
//	a = a + 5;
//	a += 5;
//	
//	int b = 12;
//	b = b >> 1;
//	b >>= 1;
//
//	return 0;
//}
//
//int main()
//{
//	//C语言中0表示假，非0表示真
//	int flag = 0;
//	//if (flag)//flag如果为真，做.....
//	//{
//	//	printf("hehe\n");
//	//}
//	//if (!flag)
//	//{
//	//	printf("hehe\n");
//	//}
//
//	printf("%d\n", flag);
//	printf("%d\n", !flag);
//
//	
//	return 0;
//}

//补充一下：布尔类型
//C99中引入的
//布尔类型就是用来表示真假的类型
//
#include <stdbool.h>
//
//bool is_leap_year(int y)
//{
//	if (((y % 4 == 0) && (y % 100 != 0)) || (y % 400 == 0))
//		return true;
//	else
//		return false;
//}
//
//int main()
//{
//	//_Bool flag = false;
//	//if (flag)
//	//{
//	//	printf("hehe\n");
//	//}
//
//	return 0;
//}



//int main()
//{
//	int a = -10;
//	printf("%d\n", a);
//	printf("%d\n", -a);
//	return 0;
//}
//

//int main()
//{
//	int a = -10;
//	printf("%d\n", a);
//	printf("%d\n", +a);
//
//	return 0;
//}

//int main()
//{
//	unsigned int num = -10;
//	printf("%u\n", num);
//
//	return 0;
//}

//
//int main()
//{
//	//int a = 10;
//	//printf("%p\n", &a);
//	//int* pa = &a;
//
//	//char ch = 'w';
//	//char*pc = &ch;
//	//
//	//char arr[10] = { 0 };
//	//char* p2 = arr;
//	//char* p3 = &arr[0];
//
//	char* p = "abcdef";
//	printf("%p\n", p);
//	printf("%c\n", *p);
//
//	return 0;
//}

//int main()
//{
//	int a = 10;
//	int*    pa = &a;
//	*pa = 20;//解引用操作
//	printf("%d\n", a);
//
//	return 0;
//}

//int main()
//{
//	*(int*)0x0012ff40;//err
//	return 0;
//}

//函数调用的时候，要写()
//但是sizeof后边的括号可以省略，说明sizeof不是函数
//
//int main()
//{
//	//int a = 10;
//	//printf("%d\n", sizeof(a));
//	//printf("%d\n", sizeof a);//ok
//	//printf("%d\n", sizeof(int));
//	//int arr[10] = {0};
//	//printf("%d\n", sizeof arr);//ok
//	//printf("%d\n", sizeof(arr));//ok
//	//printf("%d\n", sizeof(int[10]));//ok
//
//	int a = 10;
//	short s = 5;
//	printf("%d\n", sizeof(s = a + 3));
//	printf("%d\n", s);
//
//	return 0;
//}


//~ 按位取反
//00000000000000000000000000000000
//11111111111111111111111111111111 - 补码是全1
//-1

//int main()
//{
//	int a = 0;
//	printf("%d\n", ~a);//?
//
//	return 0;
//}

//& | ^ >> << ~

//int main()
//{
//	int a = 9;
//	//00000000000000000000000000001001
//	//00000000000000000000000000010000      1<<4
//	//00000000000000000000000000011001
//	//
//	//把a的二进制中第5位改成1
//	a |= (1<<4);
//	printf("%d\n", a);
//
//	//把a的二进制中的第5位改回来，变成0
//	//00000000000000000000000000011001
//	//11111111111111111111111111101111
//	//00000000000000000000000000001001
//
//	a &= (~(1 << 4));
//	printf("%d\n", a);//9
//
//	return 0;
//}
//





